{
  "ProgressNav": {
    "Contact": "Contact",
    "About": "About",
    "Skills": "Skills",
    "Experiences": "Experiences"
  },

  "Landing": {
    "Hello": "Hello, I'm Jérémie, ",
    "CreatingExperiences": "and I am Creating Engaging Experiences"
  },

  "Contact": {
    "ContactName": "Jérémie Pouliot",
    "ContactPosition": "Junior web developer",
    "FindMe": "Find me on",
    "ContactMe": "Contact me here!",
    "EmailForm": {
      "Title": "Send me a message",
      "Name": {
        "Label": "Name",
        "Placeholder": "Your name"
      },
      "Email": {
        "Label": "Email",
        "Placeholder": "your.email@example.com"
      },
      "Message": {
        "Label": "Message",
        "Placeholder": "Your message..."
      },
      "Submit": "Send Message"
    }
  },

  "Navbar": {
    "Home": "Home",
    "About": "About",
    "Contact": "Contact",
    "Homepage": "Homepage",
    "Projects": "Projects",
    "Skills": "Skills"
  },

  "About": {
    "title": "My journey",
    "BeginningCarpentry": "Professionnal Beginnings",
    "BeginningCarpentryDesc": "I began my journey in construction at carpentry school, where I learned the fundamentals of working with wood, tools, and measurements. More importantly, I developed discipline, punctuality, and a strong attention to detail—skills that would later become crucial in my career.",
    "ProfessionalExperience": "Jobsite experience",
    "ProfessionalExperienceDesc": "After graduating, I spent five years on job sites, working closely with experienced carpenters. This hands-on experience strengthened my problem-solving skills and adaptability. Teamwork and clear communication were essential daily, ensuring projects ran smoothly. Through this, I learned patience and perseverance—qualities that now shape my approach to coding and problem-solving.",
    "TransitionWebDev": "Transition to Web Development",
    "TransitionWebDevDesc": "I transitioned into web development through an intensive 8-month ACS program. The fast-paced curriculum required dedication, and by the end, only a dozen students remained out of 30. This experience solidified my technical foundation and further developed my resilience. While I enjoyed carpentry, I found the industry's structure limiting, and the physical demands challenging. Government incentives for retraining in tech provided the final push I needed to pursue web development—a field where creativity, problem-solving, and continuous learning are key.",
    "SkillDevelopment": "Skill Development",
    "SkillDevelopmentDesc": "Throughout 2023, I honed my skills in React through Udemy courses and explored Java, which helped me refine my focus on frontend development. Despite facing challenges in landing my first role, I gained valuable insights through interviews and remained committed to improving my craft.",
    "ReadyForImpact": "Ready for Impact",
    "ReadyForImpactDesc": "Eager to apply my technical skills and problem-solving mindset to real-world projects, contributing to innovative and impactful development work."
  },

  "Experience": {
    "AECTitle": "AEC in Web Development",
    "AECDesc": "8-month intensive web development program at Cegep de Sherbrooke",
    "AECTasks": [
      "Front-end development with HTML, CSS, JavaScript, PHP and introduction to Wordpress, Laravel and Bootstap.",
      "Back-end development with PHP, and database management with SQL.",
      "Web project management, version control with Git & Github, and cloud deployment (Azure)",
      "Full-stack integration, performance optimization, best practices in accessibility and security"
    ],
    "WebDevTitle": "Junior Web Developer",
    "WebDevDesc": "Junior web developer at InnovaKey, specialized in frontend development",
    "WebDevTasks": [
      "Development and maintenance of responsive and dynamic user interfaces using Next.js, React, Tailwind CSS, and TypeScript.",
      "Integration of APIs and third-party services to enhance functionality and data processing.",
      "Implementation of modular and reusable components for efficient and scalable code structure.",
      "Performance optimization, debugging, and ensuring best practices in accessibility and security."
    ]
  }
}
