{
  "Landing": {
    "Hello": "Bonjour, je suis Jérémie, ",
    "CreatingExperiences": "et je crée des expériences engageantes"
  },

  "Contact": {
    "ContactName": "Jérémie Pouliot",
    "ContactPosition": "Développeur web junior",
    "FindMe": "Trouvez moi sur",
    "ContactMe": "Contactez moi ici!",
    "EmailForm": {
      "Title": "Envoyez-moi un message",
      "Name": {
        "Label": "Nom",
        "Placeholder": "Votre nom"
      },
      "Email": {
        "Label": "Courriel",
        "Placeholder": "votre.courriel@exemple.com"
      },
      "Message": {
        "Label": "Message",
        "Placeholder": "Votre message..."
      },
      "Submit": "Envoyer le message"
    }
  },

  "Navbar": {
    "Home": "Accueil",
    "About": "À Propos",
    "Contact": "Contact",
    "Homepage": "HomePage",
    "Projects": "Projets",
    "Skills": "Compétances"
  },

  "About": {
    "title": "Mon parcous",
    "BeginningCarpentry": "Début profesionnels",
    "BeginningCarpentryDesc": "J'ai commencé mon parcours dans la construction à l'école de menuiserie, où j'ai appris les fondamentaux du travail du bois, des outils et des mesures. Plus important encore, j'ai développé la discipline, la ponctualité et une grande attention aux détails—des compétences qui deviendraient plus tard cruciales dans ma carrière.",
    "ProfessionalExperience": "Expérience en chantier",
    "ProfessionalExperienceDesc": "Après l'obtention de mon diplôme, j'ai passé cinq ans sur les chantiers, travaillant en étroite collaboration avec des menuisiers expérimentés. Cette expérience pratique a renforcé mes compétences en résolution de problèmes et mon adaptabilité. Le travail d'équipe et une communication claire étaient essentiels au quotidien, assurant le bon déroulement des projets. À travers cela, j'ai appris la patience et la persévérance—des qualités qui façonnent maintenant mon approche du codage et de la résolution de problèmes.",
    "TransitionWebDev": "Transition vers le Développement Web",
    "TransitionWebDevDesc": "J'ai fait la transition vers le développement web grâce à un programme ACS intensif de 8 mois. Le programme accéléré nécessitait du dévouement, et à la fin, seule une douzaine d'étudiants sur 30 sont restés. Cette expérience a solidifié ma base technique et développé davantage ma résilience. Bien que j'aie apprécié la menuiserie, j'ai trouvé la structure de l'industrie limitante et les exigences physiques difficiles. Les incitatifs gouvernementaux pour la reconversion dans la technologie m'ont donné l'impulsion finale dont j'avais besoin pour poursuivre le développement web—un domaine où la créativité, la résolution de problèmes et l'apprentissage continu sont essentiels.",
    "SkillDevelopment": "Développement des Compétences",
    "SkillDevelopmentDesc": "Tout au long de 2023, j'ai perfectionné mes compétences en React grâce aux cours Udemy et exploré Java, ce qui m'a aidé à affiner mon focus sur le développement frontend. Malgré les défis rencontrés pour décrocher mon premier poste, j'ai acquis de précieuses perspectives à travers les entretiens et suis resté déterminé à améliorer mon métier.",
    "ReadyForImpact": "Prêt pour l'Impact",
    "ReadyForImpactDesc": "Désireux d'appliquer mes compétences techniques et mon esprit de résolution de problèmes à des projets concrets, contribuant à un travail de développement innovant et impactant."
  },

  "Experience": {
    "AECTitle": "AEC en Développement Web",
    "AECDesc": "Programme intensif de 8 mois en développement web au Cégep de Sherbrooke",
    "AECTasks": [
      "Développement front-end avec HTML, CSS, JavaScript, PHP et introduction à WordPress, Laravel et Bootstrap.",
      "Développement back-end avec PHP et gestion de bases de données avec SQL.",
      "Gestion de projet web, contrôle de version avec Git & GitHub, et déploiement sur le cloud (Azure).",
      "Intégration full-stack, optimisation des performances, meilleures pratiques en accessibilité et sécurité."
    ],
    "WebDevTitle": "Développeur Web Junior",
    "WebDevDesc": "Développeur web junior chez Innovation Kapital-K, spécialisé dans le développement frontend",
    "WebDevTasks": [
      "Développement et maintenance d'interfaces utilisateur réactives et dynamiques avec Next.js, React, Tailwind CSS et TypeScript.",
      "Intégration d'API et de services tiers pour améliorer les fonctionnalités et le traitement des données.",
      "Mise en place de composants modulaires et réutilisables pour une structure de code efficace et évolutive.",
      "Optimisation des performances, débogage et application des meilleures pratiques en accessibilité et sécurité."
    ]
  }
}
