{
  "metadata": {
    "title": "Jérémie Pouliot | Développeur web junior",
    "description": "Portfolio présentant mon parcours, mes compétences et mes expériences en tant que développeur web"
  },
  "ProgressNav": {
    "Contact": "Contact",
    "About": "À propos",
    "Skills": "Compétences & expertises",
    "Experiences": "Expériences"
  },
  "Copyrights": "Tous droits réservés",
  "ProfilePicture": "Photo de profil de",

  "Contact": {
    "ContactName": "Jérémie Pouliot",
    "ContactPosition": "Développeur web junior"
  },

  "Skills": {
    "FrontEnd": {
      "title": "Développement Front-End",
      "description": "Création d'interfaces utilisateur réactives et interactives avec des frameworks et bibliothèques modernes.",
      "skills": [
        "HTML, CSS, JavaScript, TypeScript, TailwindCSS, Bootstrap",
        "React, Next.js",
        "HeroUI, HeroUI Pro, TailwindUI, MagicUI, AceternityUI",
        "GSAP, Framer Motion"
      ]
    },
    "BackEnd": {
      "title": "Back-End & Infrastructure",
      "description": "Conception d'applications back-end robustes et gestion d'infrastructures cloud pour des solutions évolutives.",
      "skills": [
        "PHP, Java, Node.js, Laravel",
        "API RESTful, GraphQL, Hygraph",
        "MySQL, Apache",
        "Microsoft Azure, Docker",
        "GitHub, Git"
      ]
    },
    "AI": {
      "title": "Intelligence Artificielle & Assistants",
      "description": "Utilisation d'outils d'IA et d'assistants pour améliorer le flux de développement et la productivité.",
      "skills": [
        "ChatGPT, Copilot, ClaudeAI",
        "GitHub Copilot",
        "Cline (extension VS Code)"
      ]
    },
    "Professional": {
      "title": "Compétences Professionnelles",
      "description": "Combinaison d'expertise technique et de compétences essentielles pour une collaboration efficace et le succès des projets.",
      "skills": [
        "Stratégie & Innovation",
        "Optimisation des performances",
        "Résolution de problèmes & Travail d'équipe",
        "Adaptabilité & Apprentissage continu"
      ]
    }
  },

  "Experience": {
    "ExpTitle": "Expériences professionnelles",
    "ConstructionTitle": "DEP en Charpenterie-Menuiserie et expérience sur chantier",
    "ConstructionDesc": "Cinq années d'expérience dans le domaine de la construction",
    "ConstructionTasks": [
      "Obtention d'un DEP en charpenterie-menuiserie, avec une formation spécialisée en construction résidentielle et commerciale",
      "Acquisition d'une expérience pratique sur divers chantiers, développant de solides compétences en résolution de problèmes",
      "Collaboration avec différentes équipes pour mener à bien des projets de construction complexes dans les délais impartis",
      "Maîtrise des mesures précises, des protocoles de sécurité et des normes de contrôle qualité"
    ],
    "AECTitle": "AEC en Développement web",
    "AECDesc": "Programme intensif de 8 mois en développement web au Cégep de Sherbrooke",
    "AECTasks": [
      "Développement front-end avec HTML, CSS, JavaScript et PHP, incluant une introduction à WordPress, Laravel et Bootstrap.",
      "Développement back-end avec PHP et gestion de bases de données avec SQL.",
      "Gestion de projet web, versionnement avec Git et GitHub, et déploiement cloud sur Azure.",
      "Intégration full-stack, optimisation des performances, meilleures pratiques en accessibilité et sécurité."
    ],
    "WebDevTitle": "Développeur Web junior",
    "WebDevDesc": "Développeur web junior chez Innovation Kapital-K, spécialisé dans le développement frontend",
    "WebDevTasks": [
      "Développement et maintenance d'interfaces utilisateur réactives et dynamiques avec Next.js, React, Tailwind CSS et TypeScript.",
      "Intégration d'API et de services tiers pour améliorer les fonctionnalités et le traitement des données.",
      "Mise en place de composants modulaires et réutilisables pour une structure de code efficace et évolutive.",
      "Optimisation des performances, débogage et application des meilleures pratiques en accessibilité et sécurité."
    ]
  },

  "About": {
    "title": "Mon Parcours",
    "BeginningCarpentry": "Débuts professionnels",
    "BeginningCarpentryDesc": [
      "J'ai débuté ma carrière en école de menuiserie, où j'ai appris à travailler le bois avec précision.",
      "Au-delà des aspects techniques, cette formation m'a inculqué la rigueur, la ponctualité et un grand souci du détail ; des qualités essentielles qui influencent encore aujourd'hui ma façon de travailler."
    ],

    "ProfessionalExperience": "Expérience sur chantier",
    "ProfessionalExperienceDesc": [
      "Après l'obtention de mon diplôme, j'ai passé quatre ans sur les chantiers aux côtés de menuisiers expérimentés. Cette immersion m'a appris à résoudre des problèmes rapidement et à m'adapter aux imprévus.",
      "Chaque journée nécessitait une communication claire et un bon esprit d'équipe pour mener les projets à bien. C'est dans cet environnement que j'ai développé la patience et la persévérance ; deux qualités essentielles dans le développement web."
    ],

    "TransitionWebDev": "Passage au développement web",
    "TransitionWebDevDesc": [
      "En quête d'un nouveau défi, j'ai suivi un programme intensif (AEC) de 8 mois en développement web. Le rythme exigeant demandait une grande implication, et à la fin, seuls une douzaine d'étudiants sur 30 avaient tenu le cap.",
      "Bien que la menuiserie m'ait plu, les contraintes du métier et la demande physique m'ont poussé à explorer d'autres horizons. Le domaine de la tech, avec son besoin constant d'innovation et d'apprentissage, était exactement ce qu'il me fallait."
    ],

    "SkillDevelopment": "Montée en compétences",
    "SkillDevelopmentDesc": "En 2023, j'ai perfectionné mes aptitudes en React grâce à des formations en ligne, exploré Java et trouvé un emploi, ce qui m'a aidé à affiner mon orientation vers le développement frontend. Trouver un premier poste n'a pas été simple, mais chaque défi et chaque entretien m'ont apporté des enseignements précieux, renforçant ma motivation et mes habiletés. J'ai occupé cet emploi jusqu'à la fin de l'année 2024, ce qui m'a permis d'acquérir une expérience significative et de consolider mes compétences en développement",

    "ReadyForImpact": "Prêt à faire la différence",
    "ReadyForImpactDesc": "Aujourd'hui, je suis disponible et prêt à mettre mon savoir-faire technique et mon esprit d'analyse au service de projets concrets, en contribuant à des solutions novatrices et impactantes !"
  }
}
